# props.py
import random

# 전역 시드
random.seed(42)

# param
EDGE_TRAVEL_TIME  = 1.0
ARRIVAL_GAP       = 1.0
REPLAN_DELAY      = 3.0
PARK_TIME_RANGE   = (120, 180)
SIM_TIME          = 300.0
DT                = 1.0
CONNECT_TIME      = 3.0

# ===== 한 층 지도 =====
# FLOOR_MAP_B1 = [
#     "0-----0-----0",
#     "|-R R-|-R R-|",
#     "|-R G-|-R G-|",
#     "|-R G-|-G G-|",
#     "|-G R-|-G G-|",
#     "0-----0-----0",
#     "|-R R-|-R R-|",
#     "|-R G-|-R G-|",
#     "|-R G-|-G G-|",
#     "|-R R-|-G R-|",
#     "0-----0-----0",
# ]

# FLOOR_MAP_B2 = [
#     "0-----0-----0",
#     "|-R R-|-R R-|",
#     "|-R G-|-R G-|",
#     "|-R G-|-G G-|",
#     "|-G R-|-G G-|",
#     "0-----0-----0",
#     "|-R G-|-G R-|",
#     "|-G G-|-R G-|",
#     "|-G G-|-G G-|",
#     "|-R G-|-G R-|",
#     "0-----0-----0",
# ]

FLOOR_MAP_B1 = [
    "0-----0-----0",
    "|-G G-|-G G-|",
    "|-G G-|-G G-|",
    "|-G G-|-G G-|",
    "|-G G-|-G G-|",
    "0-----0-----0",
    "|-G G-|-G G-|",
    "|-G G-|-G G-|",
    "|-G G-|-G G-|",
    "|-G G-|-G G-|",
    "0-----0-----0",
]

FLOOR_MAP_B2 = [
    "0-----0-----0",
    "|-G G-|-G G-|",
    "|-G G-|-G G-|",
    "|-G G-|-G G-|",
    "|-G G-|-G G-|",
    "0-----0-----0",
    "|-G G-|-G G-|",
    "|-G G-|-G G-|",
    "|-G G-|-G G-|",
    "|-G G-|-G G-|",
    "0-----0-----0",
]